#+title: Goban Emacs
#+AUTHOR: Italo Amaya

** PERSPECTIVE MODE
#+begin_src emacs-lisp
(use-package perspective
  :custom
  (persp-suppress-no-prefix-key-warning t)
  (persp-mode))
(force-mode-line-update)
#+end_src

#+RESULTS:
: [nil 26598 39609 55750 nil elpaca-process-queues nil nil 0 nil]

** General (keybindings)
The keybindings of emacs is like the flour of the bread. Because I come from doom emacs these follow the keybindings from DT's configuration who is also a doom emacs user! [[https://gitlab.com/dwt1/configuring-emacs/-/blob/main/06-cleaning-up-the-config/config.org?ref_type=heads#evil][Original config]].

#+begin_src emacs-lisp
;; (with-eval-after-load 'combobulate
  ;; (with-eval-after-load 'evil
    ;; (evil-define-key 'normal 'global
      ;; (kbd "S-M-h") #'combobulate-navigate-up
      ;; (kbd "S-M-l") #'combobulate-navigate-down
      ;; (kbd "S-M-k") #'combobulate-navigate-previous
      ;; (kbd "S-M-j") #'combobulate-navigate-next)))
(use-package general
  :config
  (general-evil-setup)

  ;; THis is to go up and down in wrapped lines
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
  (evil-global-set-key 'insert (kbd " ") 'org-roam-node-insert)
  (evil-define-key 'normal org-mode-map (kbd "<tab>") #'org-cycle)
  (evil-global-set-key 'normal (kbd "M-H") #'combobulate-navigate-up)
  (evil-global-set-key 'normal (kbd "M-L") #'combobulate-navigate-down)
  (evil-global-set-key 'normal (kbd "M-K") #'combobulate-navigate-previous)
  (evil-global-set-key 'normal (kbd "M-J") #'combobulate-navigate-next)
  (evil-global-set-key 'normal (kbd "M-V") #'combobulate-mark-node-dwim)

  (evil-global-set-key 'normal (kbd "M-=") #'text-scale-increase)
  (evil-global-set-key 'normal (kbd "M--") #'text-scale-decrease)

  ;; Popper
  (evil-global-set-key 'normal (kbd "C-t") 'popper-toggle)
  (evil-global-set-key 'insert (kbd "C-t") 'popper-toggle)
  (evil-global-set-key 'normal (kbd "C-<tab>") 'popper-cycle)
  (evil-global-set-key 'normal (kbd "C-f") 'avy-flash-jump)

  

  ;; Auto complete with C-SPC
  ;; (evil-global-set-key 'insert (kbd "C-SPC") 'company-complete-common)
  (evil-global-set-key 'normal "\C-s" 'consult-line)
  ;;(elpaca nil (define-key evil-insert-state-map (kbd " ") 'org-roam-node-insert))

  (evil-define-key 'insert copilot-mode-map (kbd "ç") 'copilot-accept-completion)

  (general-def mu4e-headers-mode-map
    "r" '(mu4e-view-mark-for-read :wk "Mark as read"))

  (general-create-definer flour/evil
    :states '(normal))

  (flour/evil
    :keymaps 'dirvish-mode-map
    :packages '(dired dirvish)
    "q" #'dirvish-quit
    "TAB" #'dirvish-subtree-toggle)
  ;; set up 'RET' as a secondary menu
  (general-create-definer flour/ret-keys
    :states '(normal)
    :keymaps 'org-mode-map
    :prefix "RET"
    :glbal-prefix "C-RET")

  (general-create-definer flour/ret-keys
    :states '(normal)
    :keymaps 'LaTeX-mode-map
    :prefix "RET"
    :glbal-prefix "C-RET")

  (flour/ret-keys
    "l" '(org-latex-preview :wk "preview latex fragments")
    "s" '(jinx-correct :wk "flyspell Correct word")
    "RET" '(org-open-at-point :wk "org open at point")
    "i" '(org-toggle-inline-images :wk "Show inline images")
    "x" '(org-babel-execute-src-block :wk "Execute a src code block")
    )

  (general-create-definer flour/leader-keys
    :states '(normal insert visual emacs)
    :keymaps 'override
    :prefix "SPC" ;; set leader
    :global-prefix "∫") ;; access leader in insert mode

  (flour/leader-keys
    "SPC" '(projectile-find-file :wk "Projectile find file")
    "RET" '(open-fish-term :wk "open fish shell")
    "." '(find-file :wk "Find file")
    "j" '(next-buffer :wk "next buffer")
    "k" '(previous-buffer :wk "next buffer")
    "c" '(compile :wk "compile")
    "x" '(org-capture :wk "Org capture")
    "s" '(ff-find-other-file :wk "next buffer") 
    "/" '(comment-line :wk "Comment lines"))

  (flour/leader-keys
    "TAB" '(:ignore t :wk "Perspectives")
    "TAB b" '(persp-ivy-switch-buffer :wk "Switch buffer")
    "TAB l" '(persp-switch :wk "Switch Perspective")
    "TAB k" '(persp-switch :wk "Kill Perspective")
    )

  (flour/leader-keys
    "f R" '((lambda () (interactive) (find-file italoaa-dir)) :wk "Find Project")
    "f C" '((lambda () (interactive) (find-file config-dir)) :wk "Find Config")
    "f D" '((lambda () (interactive) (find-file downloads-dir)) :wk "Find Config")
    "f c" '((lambda () (interactive) (find-file "~/.config/bread/config.org")) :wk "Edit emacs config")
    "f r" '(consult-recent-file :wk "Find recent files")
    "f b" '(consult-buffer :wk "Find buffer")
    )

  (flour/leader-keys
    "b" '(:ignore t :wk "Bookmarks/Buffers")
    "b c" '(clone-indirect-buffer :wk "Create indirect buffer copy in a split")
    "b C" '(clone-indirect-buffer-other-window :wk "Clone indirect buffer in new window")
    "b d" '(bookmark-delete :wk "Delete bookmark")
    "b i" '(ibuffer :wk "Ibuffer")
    "b k" '(kill-buffer :wk "Kill this buffer")
    "b K" '(kill-all-except-dashboard-and-essential :wk "Kill All except escential")
    "b l" '(list-bookmarks :wk "List bookmarks")
    "b j" '(bookmark-jump :wk "Bookmark Jump")
    "b m" '(bookmark-set :wk "Set bookmark")
    "b n" '(next-buffer :wk "Next buffer")
    "b p" '(previous-buffer :wk "Previous buffer")
    "b r" '(revert-buffer :wk "Reload buffer")
    "b R" '(rename-buffer :wk "Rename buffer")
    "b s" '(basic-save-buffer :wk "Save buffer")
    "b S" '(save-some-buffers :wk "Save multiple buffers")
    "b w" '(bookmark-save :wk "Save current bookmarks to bookmark file"))

  (flour/leader-keys
    "y" '(:ignore t :wk "Yeetube")
    "y RET" '(yeetube-play :wk "Play video")
    "y d" '(yeetube-download-video :wk "Download video")
    "y b" '(yeetube-play-saved-video :wk "Play saved video")
    "y B" '(yeetube-save-video :wk "Save video")
    "y x" '(yeetube-remove-saved-video :wk "Remove saved video")
    "y /" '(yeetube-search :wk "Search")
    "y 0" '(yeetube-toggle-video :wk "Toggle video"))

  (flour/leader-keys
    "d" '(:ignore t :wk "Detached")
    "d d" '(detached-detach-session :wk "detach from session")
    "d a" '(detached-attach-session :wk "attach to session")
    "d l" '(detached-list-sessions :wk "lsit sessions")
    "d k" '(detached-kill-session :wk "kill sesssion"))

  (flour/leader-keys
    "e" '(:ignore t :wk "Eshell/Evaluate")
    "e b" '(eval-buffer :wk "Evaluate elisp in buffer")
    "e d" '(eval-defun :wk "Evaluate defun containing or after point")
    "e e" '(eval-expression :wk "Evaluate and elisp expression")
    "e h" '(counsel-esh-history :which-key "Eshell history")
    "e l" '(eval-last-sexp :wk "Evaluate elisp expression before point")
    "e r" '(eval-region :wk "Evaluate elisp in region")
    "e s" '(eshell :which-key "Eshell"))

  (flour/leader-keys
    "h" '(:ignore t :wk "Help")
    "h H" '(my/hf-model-config-json-to-buffer :wk "get HuggingFace model config")
    "h a" '(counsel-apropos :wk "Apropos")
    "h b" '(describe-bindings :wk "Describe bindings")
    "h c" '(describe-char :wk "Describe character under cursor")
    "h d" '(:ignore t :wk "Emacs documentation")
    "h d a" '(about-emacs :wk "About Emacs")
    "h d d" '(view-emacs-debugging :wk "View Emacs debugging")
    "h d f" '(view-emacs-FAQ :wk "View Emacs FAQ")
    "h d m" '(info-emacs-manual :wk "The Emacs manual")
    "h d n" '(view-emacs-news :wk "View Emacs news")
    "h d o" '(describe-distribution :wk "How to obtain Emacs")
    "h d p" '(view-emacs-problems :wk "View Emacs problems")
    "h d t" '(view-emacs-todo :wk "View Emacs todo")
    "h d w" '(describe-no-warranty :wk "Describe no warranty")
    "h e" '(view-echo-area-messages :wk "View echo area messages")
    "h f" '(describe-function :wk "Describe function")
    "h F" '(describe-face :wk "Describe face")
    "h g" '(describe-gnu-project :wk "Describe GNU Project")
    "h i" '(info :wk "Info")
    "h I" '(describe-input-method :wk "Describe input method")
    "h k" '(describe-key :wk "Describe key")
    "h l" '(view-lossage :wk "Display recent keystrokes and the commands run")
    "h L" '(describe-language-environment :wk "Describe language environment")
    "h m" '(describe-mode :wk "Describe mode")
    "h r" '(:ignore t :wk "Reload")
    "h r r" '((lambda () (interactive)
                (load-file "~/.config/emacs/init.el")
                (ignore (elpaca-process-queues)))
              :wk "Reload emacs config")
    "h t" '(load-theme :wk "Load theme")
    "h v" '(describe-variable :wk "Describe variable")
    "h w" '(where-is :wk "Prints keybinding for command if set")
    "h x" '(describe-command :wk "Display full documentation for command"))

  (flour/leader-keys
    "M" '(:ignore t :wk "Modes")
    "M o" '(org-mode t :wk "Org mode")
    "M p" '(python-ts-mode t :wk "Python mode")
    "M e" '(emacs-lisp-mode t :wk "Elisp mode")
    "M c" '(c-ts-mode t :wk "Elisp mode")
    "M C" '(c++-ts-mode t :wk "Elisp mode")
    )
  (flour/leader-keys
    "m" '(:ignore t :wk "Org")
    "m a" '(org-agenda :wk "Org agenda")
    "m e" '(org-export-dispatch :wk "Org export dispatch")
    "m i" '(org-toggle-item :wk "Org toggle item")
    "m t" '(org-todo :wk "Org todo")
    "m B" '(org-babel-tangle :wk "Org babel tangle")
    "m T" '(org-todo-list :wk "Org todo list")
    "m c" '(:ignore t :wk "Org Clock")
    "m c i" '(org-clock-in :wk "Org clock in")
    "m c o" '(org-clock-out :wk "Org clock out")
    "m c g" '(org-clock-goto :wk "Org clock goto")
    "m c r" '(org-clock-report :wk "Org clock report")
    "m b" '(:ignore t :wk "Tables")
    "m b -" '(org-table-insert-hline :wk "Insert hline in table")
    "m d" '(:ignore t :wk "Date/deadline")
    "m d t" '(org-time-stamp :wk "Org time stamp"))

  (flour/leader-keys
    "p" '(projectile-command-map :wk "Projectile"))

  (flour/leader-keys
    "t" '(:ignore t :wk "Toggle")
    "t f" '(jinx-mode :wk "Toggle flycheck")
    "t l" '(display-line-numbers-mode :wk "Toggle line numbers")
    "t r" '(rainbow-mode :wk "Toggle rainbow mode")
    "t u" '(org-tidy-untidy-buffer :wk "Untify current buffer until save")
    "t s" '(spacious-padding-mode :wk "Toggle spacious padding mode")
    "t d" '(my/toggle-undecorated-frame :wk "Toggle decorations")
    "t t" '(org-sidebar-tree-toggle :wk "Toggle the org tree")
    "t i" '(org-toggle-inline-images :wk "toggle inline images"))

  (flour/leader-keys
    "f" '(:ignore t :wk "File")
    "f s" #'save-buffer)

  (flour/leader-keys
    "n" '(:ignore t :wk "Roam notes")
    "n i" '(org-roam-node-insert :wk "Insert node at point")
    "n u" '(org-roam-ui-open :wk "Insert node at point")
    "n p" '(org-download-clipboard :wk "Paste Image from clipboard")
    "n a" '(org-roam-alias-add :wk "Add an alias")
    "n t" '(org-roam-tag-add :wk "Add a tag")
    "n T" '(org-roam-tag-remove :wk "Remove a tag")
    "n A" '(org-roam-alias-remove :wk "Remove an alias")
    "n s" '(org-narrow-to-subtree :wk "Narrow focus to subtree")
    "n w" '(widen :wk "Widen focus")
    "n f" '(org-roam-node-find :wk "Find node"))

  (flour/leader-keys
    "l" '(:ignore t :wk "lsp")
    ;; Window splits
    "l r" '(eglot-rename :wk "Lsp Rename")
    "l d" '(eglot-find-declaration :wk "e find declaration")
    "l D" '(eglot-find-typeDefinition :wk "e find type definition")
    "l i" '(eglot-find-implementation :wk "e Find impl")
    )

  (flour/leader-keys
    "w" '(:ignore t :wk "Windows")
    ;; Window splits
    "w c" '(evil-window-delete :wk "Close window")
    "w n" '(evil-window-new :wk "New window")
    "w s" '(evil-window-split :wk "Horizontal split window")
    "w v" '(evil-window-vsplit :wk "Vertical split window")
    ;; Window motions
    "w h" '(evil-window-left :wk "Window left")
    "w j" '(evil-window-down :wk "Window down")
    "w k" '(evil-window-up :wk "Window up")
    "w l" '(evil-window-right :wk "Window right")
    "w w" '(evil-window-next :wk "Goto next window")
    ;; Move Windows
    "w H" '(windmove-swap-states-left :wk "Buffer move left")
    "w J" '(windmove-swap-states-down :wk "Buffer move down")
    "w K" '(windmove-swap-states-up :wk "Buffer move up")
    "w L" '(windmove-swap-states-right :wk "Buffer move right"))

  (flour/leader-keys
    "g" '(:ignore t :wk "Git")
    "g g" '(magit :wk "Magit"))

  ;;   (general-define-key
  ;;    :state '(normal vis)
  ;;    "u" '(nil)
  ;;    "C-r" 'undo-tree-redo)

  (general-define-key)
  )

;; (evil-define-key 'normal dired-mode-map (kbd "C-u") #'evil-scroll-up)
#+end_src

#+RESULTS:
: [nil 26593 55668 903268 nil elpaca-process-queues nil nil 0 nil]

** Indent bars mode
#+begin_src emacs-lisp
(use-package indent-bars
  :ensure (:host github :repo "jdtsmith/indent-bars" :files ("indent-bars.el"))
  :hook ((python-ts-mode yaml-ts-mode) . indent-bars-mode)) ; or whichever modes you prefer
#+end_src

#+RESULTS:
: [nil 26605 3971 531667 nil elpaca-process-queues nil nil 0 nil]
** AI
#+begin_src emacs-lisp
(use-package copilot
  :ensure t
  :hook (prog-mode . copilot-mode)
  :bind (:map copilot-completion-map
              ("C-<tab>" . copilot-accept-completion)
              ("C-TAB" . copilot-accept-completion)))


(use-package shell-maker)

(use-package agent-shell
  :after shell-maker
  :config

  (setq agent-shell-anthropic-claude-environment
        (agent-shell-make-environment-variables
         "ANTHROPIC_API_KEY" "litellm-0e0c642f-b069-40a2-bb3a-1af9167cc2cd"
         "ANTHROPIC_BASE_URL" "http://localhost:4000"))

  (add-to-list 'exec-path (expand-file-name ".npm-global/bin" gnus-home-directory))

  ;; Evil state-specific RET behavior: insert mode = newline, normal mode = send
  (evil-define-key 'insert agent-shell-mode-map (kbd "RET") #'newline)
  (evil-define-key 'normal agent-shell-mode-map (kbd "RET") #'comint-send-input)

  ;; Configure *agent-shell-diff* buffers to start in Emacs state
  (add-hook 'diff-mode-hook
            (lambda ()
              (when (string-match-p "\\*agent-shell-diff\\*" (buffer-name))
                (evil-emacs-state)))))

#+end_src

#+RESULTS:
: [nil 26852 48212 21012 nil elpaca-process-queues nil nil 30000 nil]

** Treesit
#+begin_src emacs-lisp
(use-package combobulate
   :ensure (:host github :repo "mickeynp/combobulate" :files ("*.el"))
   :hook ((prog-mode . combobulate-mode)))

;; https://robbmann.io/posts/emacs-treesit-auto/
(use-package treesit-auto
  :custom
  (treesit-auto-install 'prompt)
  :config
  (setq treesit-auto-langs '(bash c cpp css html javascript json lua python rust toml typescript yaml latex))
  (global-treesit-auto-mode))
#+end_src

#+RESULTS:
: [nil 26999 13373 340540 nil elpaca-process-queues nil nil 719000 nil]

** Corfu
#+begin_src emacs-lisp
(use-package corfu
  ;; Optionally use TAB for cycling, default is `corfu-complete'.
  :bind (:map corfu-map
              ("M-SPC"      . corfu-insert-separator)
              ("TAB"        . corfu-next)
              ([tab]        . corfu-next)
              ("S-TAB"      . corfu-previous)
              ([backtab]    . corfu-previous)
              ("S-<return>" . corfu-insert)
              ("<return>"        . nil))
  :custom
  (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
  (corfu-auto t)                 ;; Enable auto completion
  (corfu-auto-prefix 2)
  (corfu-auto-delay 0.1)
  (corfu-popupinfo-delay '(0.5 . 0.2))
  (corfu-preview-current 'insert) ; insert previewed candidate
  (corfu-preselect 'prompt)
  (corfu-on-exact-match nil)      ; Don't auto expand tempel snippets
  :init
  (global-corfu-mode)
  )
#+end_src

#+RESULTS:
: [nil 26935 57523 413344 nil elpaca-process-queues nil nil 858000 nil]

** Vertico consult and marginalia
#+begin_src emacs-lisp
(use-package vertico
  :init
  (vertico-mode)
  ;; Grow and shrink the Vertico minibuffer
  (setq vertico-resize t)
  ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
  ;; (setq vertico-cycle t)
  )

(use-package prescient)
(use-package vertico-prescient
  :config
  (vertico-prescient-mode))
(use-package corfu-prescient
  :config
  (corfu-prescient-mode))

(use-package consult
  ;; Enable automatic preview at point in the *Completions* buffer. This is
  ;; relevant when you use the default completion UI.
  :hook (completion-list-mode . consult-preview-at-point-mode)

  ;; The :init configuration is always executed (Not lazy)
  :init

  ;; Optionally configure the register formatting. This improves the register
  ;; preview for `consult-register', `consult-register-load',
  ;; `consult-register-store' and the Emacs built-ins.
  (setq register-preview-delay 0.5
        register-preview-function #'consult-register-format)

  ;; Optionally tweak the register preview window.
  ;; This adds thin lines, sorting and hides the mode line of the window.
  (advice-add #'register-preview :override #'consult-register-window)

  ;; Use Consult to select xref locations with preview
  (setq xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref)

  ;; Configure other variables and modes in the :config section,
  ;; after lazily loading the package.
  :config

  ;; Optionally configure preview. The default value
  ;; is 'any, such that any key triggers the preview.
  ;; (setq consult-preview-key 'any)
  ;; (setq consult-preview-key "M-.")
  ;; (setq consult-preview-key '("S-<down>" "S-<up>"))
  ;; For some commands and buffer sources it is useful to configure the
  ;; :preview-key on a per-command basis using the `consult-customize' macro.
  (consult-customize
   consult-theme :preview-key '(:debounce 0.2 any)
   consult-ripgrep consult-git-grep consult-grep
   consult-bookmark consult-recent-file consult-xref
   consult--source-bookmark consult--source-file-register
   consult--source-recent-file consult--source-project-recent-file
   ;; :preview-key "M-."
   :preview-key '(:debounce 0.4 any))

  ;; Optionally configure the narrowing key.
  ;; Both < and C-+ work reasonably well.
  (setq consult-narrow-key "<") ;; "C-+"

  ;; Optionally make narrowing help available in the minibuffer.
  ;; You may want to use `embark-prefix-help-command' or which-key instead.
  ;; (define-key consult-narrow-map (vconcat consult-narrow-key "?") #'consult-narrow-help)

  ;; By default `consult-project-function' uses `project-root' from project.el.
  ;; Optionally configure a different project root function.
  (autoload 'projectile-project-root "projectile")
  (setq consult-project-function (lambda (_) (projectile-project-root)))
  )

;; Enable rich annotations using the Marginalia package
(use-package marginalia
  ;; Bind `marginalia-cycle' locally in the minibuffer.  To make the binding
  ;; available in the *Completions* buffer, add it to the
  ;; `completion-list-mode-map'.
  ;; :bind (:map minibuffer-local-map
  ;;       ("M-A" . marginalia-cycle))

  ;; The :init section is always executed.
  :init

  ;; Marginalia must be activated in the :init section of use-package such that
  ;; the mode gets enabled right away. Note that this forces loading the
  ;; package.
  (marginalia-mode))

(use-package orderless
  :init
  ;; Configure a custom style dispatcher (see the Consult wiki)
  ;; (setq orderless-style-dispatchers '(+orderless-consult-dispatch orderless-affix-dispatch)
  ;;       orderless-component-separator #'orderless-escapable-split-on-space)
  (setq completion-styles '(orderless basic)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion)))))
#+end_src

#+RESULTS:
: [nil 26403 21055 182396 nil elpaca-process-queues nil nil 0 nil
** Variables
#+begin_src emacs-lisp
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(org-document-title ((t (:inherit default :weight normal  :height 2.0 :underline nil))))
 '(org-level-1 ((t (:inherit default :weight regular  :height 1.75))))
 '(org-level-2 ((t (:inherit default :weight regular  :height 1.5))))
 '(org-level-3 ((t (:inherit default :weight regular  :height 1.25))))
 '(org-level-4 ((t (:inherit default :weight regular  :height 1.1))))
 '(org-level-5 ((t (:inherit default :weight regular ))))
 '(org-level-6 ((t (:inherit default :weight regular ))))
 '(org-level-7 ((t (:inherit default :weight regular ))))
 '(org-level-8 ((t (:inherit default :weight regular )))))

;; Unbind RET for going to links
;;(elpaca nil (evil-define-key 'normal evil-motion-mode-map (kbd "RET") nil))
(setq org-return-follows-link t
                 org-image-actual-width nil)

;; Opens file links in the same window
(add-to-list 'org-link-frame-setup '(file . find-file))

(setq org-startup-indented t)
(setq org-edit-src-content-indentation 0)
(setq org-clock-sound (concat user-emacs-directory "bell.wav"))

(setq org-image-actual-width nil)

(setq org-agenda-files
      '("~/org/Agenda/2026/outlook.org"))


(require 'org-tempo)
(require 'org-habit)

;; (require 'ox-extra)
;; (ox-extras-activate '(latex-header-blocks ignore-headlines))
;; (add-to-list 'org-modules 'org-habit)

#+end_src

#+RESULTS:
| org-habit | ol-doi | ol-w3m | ol-bbdb | ol-bibtex | ol-docview | ol-gnus | ol-info | ol-irc | ol-mhe | ol-rmail | ol-eww |

** Latex
#+begin_src emacs-lisp
;; bind tab to outline-cycle
;; prettify symbols in LaTeX mode
(use-package auctex
  :defer t
  :config
  (add-hook 'LaTeX-mode-hook 'outline-minor-mode)
  ;; (add-hook 'LaTeX-mode-hook 'prettify-symbols-mode)
  (with-eval-after-load 'outline
	(define-key outline-minor-mode-map (kbd "<tab>") 'outline-cycle)))
(use-package evil-surround)
(use-package evil-embrace
  :config
  (evil-embrace-enable-evil-surround-integration))
(use-package evil-tex
  :config
  (add-hook 'LaTex-mode-hook 'evil-tex-mode))
#+end_src

#+RESULTS:
: [nil 26983 41735 567930 nil elpaca-process-queues nil nil 345000 nil]

